cpy111111/stm32-study/4-1 oled驱动/Hardware/Buzzer.c
#include "stm32f10x.h"                  // Device header

void Buzzer_Init(void){
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB,ENABLE);
	
	GPIO_InitTypeDef GPIO_InitStruct;
	GPIO_InitStruct.GPIO_Mode=GPIO_Mode_Out_PP;
	GPIO_InitStruct.GPIO_Pin=GPIO_Pin_12;
	GPIO_InitStruct.GPIO_Speed=GPIO_Speed_50MHz;
	GPIO_Init(GPIOB,&GPIO_InitStruct);
	
	GPIO_SetBits(GPIOB,GPIO_Pin_12);
	
}	

void Buzzer_Set(unsigned char c){
	switch (c){
		case 1:GPIO_ResetBits(GPIOB,GPIO_Pin_12);break;
		case 0:GPIO_SetBits(GPIOB,GPIO_Pin_12);break;
	}
}	

void Buzzer_Turn(unsigned char c){
	switch (c){
		case 1:
			if(GPIO_ReadOutputDataBit(GPIOB,GPIO_Pin_12)==0)GPIO_SetBits(GPIOB,GPIO_Pin_12);
			else GPIO_ResetBits(GPIOB,GPIO_Pin_12);
			break;
		case 2:
			if(GPIO_ReadOutputDataBit(GPIOB,GPIO_Pin_12)==0)GPIO_SetBits(GPIOB,GPIO_Pin_12);
			else GPIO_ResetBits(GPIOB,GPIO_Pin_12);break;
			break;
	}
}	
